#pragma once
#include <stdint.h>

class WeaponEnumPistol
{
public:
   void* m_vmt; // 0x0000 
   char _0x0004[4];
   uintptr_t* weaponBaseNameStruct; // 0x0008 
   uintptr_t* weaponNameStruct; // 0x000C 
   uintptr_t* weapBaseWeaponType; // 0x0010 
   uintptr_t* invWeaponType; // 0x0014 
   char _0x0018[72];
   float N1237D668; // 0x0060 
   char _0x0064[16];
   float N1237D663; // 0x0074 
   char _0x0078[16];
   float N1237D65E; // 0x0088 
   char _0x008C[20];
   float N123769DB; // 0x00A0 
   char _0x00A4[16];
   float N123769E0; // 0x00B4 
   char _0x00B8[16];
   float N1237EEC5; // 0x00C8 
   char _0x00CC[20];
   float N1237EECB; // 0x00E0 
   char _0x00E4[16];
   float N1237EED0; // 0x00F4 
   char _0x00F8[16];
   float N12380153; // 0x0108 
   char _0x010C[52];
   uintptr_t* _0x0140; // 0x0140 
   char _0x0144[4];
   uintptr_t* _0x0148; // 0x0148 
   char _0x014C[4];
   uintptr_t* _0x0150; // 0x0150 
   uintptr_t* _0x0154; // 0x0154 
   char _0x0158[40];
   uintptr_t* _0x0180; // 0x0180 
   char _0x0184[4];
   uintptr_t* _0x0188; // 0x0188 
   char _0x018C[4];
   uintptr_t* _0x0190; // 0x0190 
   char _0x0194[4];
   uintptr_t* _0x0198; // 0x0198 
   char _0x019C[8];
   uintptr_t* _0x01A4; // 0x01A4 
   char _0x01A8[4];
   uintptr_t* _0x01AC; // 0x01AC 
   char _0x01B0[16];
   uintptr_t* _0x01C0; // 0x01C0 
   uintptr_t* _0x01C4; // 0x01C4 
   uintptr_t* _0x01C8; // 0x01C8 
   char _0x01CC[4];
   uintptr_t* _0x01D0; // 0x01D0 
   char _0x01D4[8];
   uintptr_t* _0x01DC; // 0x01DC 
   uintptr_t* _0x01E0; // 0x01E0 
   char _0x01E4[12];
   uintptr_t* _0x01F0; // 0x01F0 
   uintptr_t* _0x01F4; // 0x01F4 
   char _0x01F8[4];
   uintptr_t* _0x01FC; // 0x01FC 
   uintptr_t* _0x0200; // 0x0200 
   char _0x0204[4];
   uintptr_t* _0x0208; // 0x0208 
   char _0x020C[4];
   uintptr_t* _0x0210; // 0x0210 
   uintptr_t* _0x0214; // 0x0214 
   char _0x0218[4];
   uintptr_t* _0x021C; // 0x021C 
   char _0x0220[8];
   uintptr_t* _0x0228; // 0x0228 
   uintptr_t* _0x022C; // 0x022C 
   char _0x0230[4];
   uintptr_t* _0x0234; // 0x0234 
   char _0x0238[12];
   uintptr_t* _0x0244; // 0x0244 
   uintptr_t* _0x0248; // 0x0248 
   char _0x024C[4];
   uintptr_t* _0x0250; // 0x0250 
   char _0x0254[4];
   uintptr_t* _0x0258; // 0x0258 
   char _0x025C[12];
   uintptr_t* _0x0268; // 0x0268 
   uintptr_t* _0x026C; // 0x026C 
   char _0x0270[8];
   uintptr_t* _0x0278; // 0x0278 
   uintptr_t* _0x027C; // 0x027C 
   uintptr_t* _0x0280; // 0x0280 
   uintptr_t* _0x0284; // 0x0284 
   char _0x0288[4];
   uintptr_t* _0x028C; // 0x028C 
   uintptr_t* _0x0290; // 0x0290 
   char _0x0294[20];
   uintptr_t* _0x02A8; // 0x02A8 
   char _0x02AC[4];
   uintptr_t* _0x02B0; // 0x02B0 
   char _0x02B4[4];
   uintptr_t* _0x02B8; // 0x02B8 
   uintptr_t* _0x02BC; // 0x02BC 
   uintptr_t* _0x02C0; // 0x02C0 
   uintptr_t* _0x02C4; // 0x02C4 
   char _0x02C8[16];
   uintptr_t* _0x02D8; // 0x02D8 
   uintptr_t* _0x02DC; // 0x02DC 
   uintptr_t* _0x02E0; // 0x02E0 
   char _0x02E4[8];
   uintptr_t* _0x02EC; // 0x02EC 
   char _0x02F0[4];
   uintptr_t* _0x02F4; // 0x02F4 
   uintptr_t* _0x02F8; // 0x02F8 
   char _0x02FC[8];
   uintptr_t* _0x0304; // 0x0304 
   uintptr_t* _0x0308; // 0x0308 
   char _0x030C[12];
   uintptr_t* _0x0318; // 0x0318 
   uintptr_t* _0x031C; // 0x031C 
   char _0x0320[16];
   uintptr_t* _0x0330; // 0x0330 
   uintptr_t* _0x0334; // 0x0334 
   uintptr_t* _0x0338; // 0x0338 
   char _0x033C[12];
   uintptr_t* _0x0348; // 0x0348 
   char _0x034C[4];

}; // Size=0x0350

class WeaponEnumCategory
{
public:
   void* m_vmt; // 0x0000 
   uintptr_t* m_weaponGround; // 0x0004 
   uintptr_t* m_weaponGroupName; // 0x0008 

}; // Size=0x000C